app/views/comments/_comment.html.erb

   <p><strong>
   Posted <%= time_ago_in_words(comment.created_at) %>
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "this is a comment test"], ["created_at", Wed, 03 Oct 2012 08:06:02 UTC +00:00], ["post_id", 3], ["updated_at", Wed, 03 Oct 2012 08:06:02 UTC +00:00]]