app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hello"], ["created_at", Tue, 25 Sep 2012 08:01:07 UTC +00:00], ["title", "Test Post"], ["updated_at", Tue, 25 Sep 2012 08:01:07 UTC +00:00]]